from dependencies._dependencies import asyncio, process, fuzz


async def find_most_compatible_response(response: str, scenarios: list) -> str:
    """
    Находит сценарий с наибольшей совместимостью с ответом.

    :param response: Ответ ассистента
    :param scenarios: Список сценариев для сравнения
    :return: Сценарий с наибольшей совместимостью
    """
    most_compatible_response = max(
        scenarios, key=lambda scenario: fuzz.ratio(response.lower(), scenario.lower())
    )
    return most_compatible_response


russian_cities = [
    "москва",
    "санкт-петербург",
    "новосибирск",
    "екатеринбург",
    "казань",
    "нижний новгород",
    "челябинск",
    "самара",
    "омск",
    "ростов-на-дону",
    "уфа",
    "красноярск",
    "пермь",
    "волгоград",
    "воронеж",
    "владивосток",
    "иркутск",
    "тюмень",
    "барнаул",
    "пятигорск",
    "сочи",
    "ярославль",
    "тула",
    "псков",
    "смоленск",
    "кострома",
    "тамбов",
    "орел",
    "липецк",
    "вологда",
    "петрозаводск",
    "саратов",
    "ульяновск",
    "якутск",
    "владикавказ",
    "махачкала",
    "чита",
    "анапа",
    "грозный",
    "нефтекамск",
    "пенза",
    "чебоксары",
    "магнитогорск",
    "мурманск",
    "геленджик",
    "тверь",
    "петропавловск",
    "калуга",
    "шахты",
    "коломна",
    "усть-илимск",
    "всеволожск",
    "набережные челны",
    "киров",
    "кемерово",
    "жуковский",
    "хабаровск",
    "сургут",
    "химки",
    "таганрог",
    "псков",
    "тулун",
    "брянск",
    "братск",
    "северодвинск",
    "петропавловск",
    "североморск",
    "долгопрудный",
    "волжский",
    "зеленоград",
    "углич",
    "тихвин",
    "сызрань",
    "орехово-зуево",
    "славгород",
    "прокопьевск",
    "питкяранта",
    "суходол",
    "челябинск",
    "дмитров",
    "муром",
    "салават",
    "губкин",
    "дружковка",
    "очер",
    "саранск",
    "кострома",
    "златоуст",
    "павлово",
    "соль-илецк",
    "воскресенск",
]


async def find_closest_city(city_name: str):
    # Поиск наилучшего совпадения с учётом опечаток
    result = process.extractOne(city_name, russian_cities, score_cutoff=70)
    return result


async def main(user_input: str):
    # Поиск ближайшего города
    closest_city = await find_closest_city(user_input)

    if closest_city:
        match, score = closest_city
        print(f"Самое близкое совпадение: {match}, коэффициент: {score}")
    else:
        print("Город не найден.")


# Пример ввода от пользователя
user_input = "нижний ного"  # или любой другой ввод

# Запуск асинхронного кода
asyncio.run(main(user_input))
